{
    "language": "eng",
    "license": "MIT",
    "title": "ncvue: a minimal GUI for a quick view of netcdf files",
    "related_identifiers": [
        {
            "scheme": "url",
            "identifier": "https://github.com/mcuntz/ncvue/",
            "relation": "isDerivedFrom",
            "resource_type": "software"
        },
        {
            "scheme": "url",
            "identifier": "https://mcuntz.github.io/ncvue/",
            "relation": "isDocumentedBy",
            "resource_type": "publication-softwaredocumentation"
        },
        {
            "scheme": "url",
            "identifier": "https://pypi.org/project/ncvue/",
            "relation": "isIdenticalTo",
            "resource_type": "software"
        }
    ],
    "upload_type": "software",
    "keywords": [
        "netcdf",
        "viewer",
        "GUI",
        "maps",
        "plot"
    ],
    "creators": [
        {
            "orcid": "0000-0002-5966-1829",
            "affiliation": "Institut National de Recherche pour l'Agriculture, l'Alimentation et l'Environnement - INRAE, Nancy, France",
            "name": "Matthias Cuntz"
        }
    ],
    "access_right": "open",
    "description": "<p><strong>ncvue</strong> is a minimal GUI for a quick view of netCDF files. It is aiming to be a drop-in replacement for <a href=\"http://meteora.ucsd.edu/~pierce/ncview_home_page.html\">ncview</a>, being slightly more general than <a href=\"http://meteora.ucsd.edu/~pierce/ncview_home_page.html\">ncview</a>, which targets maps. If <strong>ncvue</strong> is used with maps, it supports mostly structured grids, more precisely the grids supported by <a href=\"https://scitools.org.uk/cartopy/docs/latest/\">cartopy</a>.</p>\n\n<p><strong>ncvue</strong> is a Python script that can be called from within Python or as a command line tool. It is not supposed to produce publication-ready plots but rather provide a quick overview of the netCDF file.</p>\n\n<p>The complete documentation for <strong>ncvue</strong> is available from: <a href=\"https://mcuntz.github.io/ncvue/\">https://mcuntz.github.io/ncvue/</a></p>\n\n<p>The current version features three panels, that means three different plotting styles: Scatter/Line plots, Contour Plots, and Maps, with extensive tooltips on buttons, sliders, entry boxes, spinboxes, and menus. It includes the possibility to open and change netCDF files within <strong>ncvue</strong>. The netCDF file will be changed in all panels of the primary window and any secondary window once focus changes on the panel or window. Graphical documentation exists on <a href=\"https://mcuntz.github.io/ncvue/\">Github Pages</a>.</p>\n\n<p>The current version also provides two standalone applications on macOS and on Windows that come with all necessary libraries to run <strong>ncvue</strong>, including Python. Links to the installers are given on <a href=\"https://github.com/mcuntz/ncvue/\">Github</a> and in the <a href=\"https://mcuntz.github.io/ncvue/\">documentation</a>.</p>\n\n<p>Version 3.6 added different designs on macOS, Windows and Linux.</p>\n\n<p>Version 4.0 moved to a new project structure, using pyproject.toml, automatic versioning, src layout, and Github actions for continuous integration.</p>\n\n<p>Version 4.1 ported <strong>ncvue</strong> to conda-forge.</p>\n\n<p>Version 4.2 allowed groups in netcdf files.</p>"
}
